export const mainDetail = [
    {
        id: 1,
        title: "선언형",
        content: "React는 상호작용이 많은 UI를 만들 때 생기는 어려움을 줄여줍니다. 애플레케이션의 각 상태에 대한 간단반 뷰만 설계하세요. 그럼 React는 데이터가 변경됨에 따라 적절한 컴포넌트만 효율적으로 생긴하고 렌더링 합니다." ,
        summary: "선언형 뷰는 코드를 예측 가능하고, 디버그하기 쉽게 만들어 줍니다."
    },
    {
        id: 2,
        title : "컴포넌트 기반",
        content: "스스로 상태를 관리하는 캡슐화된 컴포텉느틑 만드세요. 그리고 이를 조잡해 복잡한 UI를 만들어보세요.",
        summary: "컴포넌트 로직은 템플릿이아닌 Javascript로 작성됩니다. 따라서 다양한 형식의 데이터를 앱 안에서 손쉽게 전달할 수 있고, DOM과 별개로 상태를 관리할 수 있습니다."
    
    },
    {
        id: 3,
        title: "한 번 배워서 어디서나 사용하기",
        content: "기술 스택의 나머지 부분에는 관여하지 않기때문에, 기존 코드를 다시 작성하지 않고도 React의 새로운 기능을 이용해서 개발할 수 있습니다.",
        summary: "React는 Node 서버에서 렌더링을 할 수도 있고, React를 이용하면 모바일 앱도 만들 수 있습니다."
    }
]